Public Attributes | List of all members
API_OpeningExtrusionGeometryData Struct Reference
Element Manager
Extrusion geometry parameters. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Plane3D  | frame
Opening base plane.
 API_OpeningExtrusionParameters  | parameters
Extrusion parameters.
 API_Polygon  | customBasePolygon
Reserved for future use.
Detailed Description
Extrusion geometry parameters.